app/Http/Controllers/CartController.php

    public function payment()
    {
        $orders = Order::with(['customers', 'orderproducts', 'couriers', 'cities', 'zones', 'admins'])->where('id', Session::get('order_id'))->first();
        return view('webview.content.cart.payment')->with('orders', $orders);
---
select * from `couriers` where `couriers`.`id` in (1)
select * from `customers` where `customers`.`order_id` in (2)
select * from `orderproducts` where `orderproducts`.`order_id` in (2)
select * from `orders` where `id` = 2 limit 1
select * from `admins` where 0 = 1
select * from `cities` where 0 = 1
select * from `zones` where 0 = 1