app/Http/Controllers/WebviewController.php

    public function mainview()
    {
        $categories = Category::with('subcategories')->where('status', 'Active')->get();
        $brands = Brand::where('status', 'Active')->get();
        $sliders = Slider::where('status', 'Active')->select('id', 'slider_btn_link', 'slider_title', 'slider_image')->get();
        $adds = Addbanner::where('status', 'Active')->whereIn('id', ['1', '2'])->select('id', 'add_link', 'add_image', 'status')->get();
        $addbottoms = Addbanner::where('status', 'Active')->whereIn('id', ['3', '4'])->select('id', 'add_link', 'add_image', 'status')->get();

        $topproducts = Mainproduct::where('status', 'Active')->where('top_rated', '1')->orderByRaw('ISNULL(`position`), `position` ASC')->select('id', 'ProductName', 'ProductSlug', 'ProductImage', 'ProductHoverImage', 'status', 'position', 'top_rated', 'RelatedProductIds')->latest()->get();
        $bestselling = Mainproduct::where('status', 'Active')->where('bestselling', '1')->orderByRaw('ISNULL(`position`), `position` ASC')->select('id', 'ProductName', 'ProductSlug', 'ProductImage', 'ProductHoverImage', 'status', 'position', 'top_rated', 'RelatedProductIds')->latest()->get();
        $allProducts = Mainproduct::where('status', 'Active')->orderByRaw('ISNULL(`position`), `position` ASC')->select('id', 'ProductName', 'ProductSlug', 'ProductImage', 'ProductHoverImage', 'status', 'position', 'top_rated', 'RelatedProductIds')->latest()->get();

        $our_products = Mainproduct::where('status', 'Active')->orderByRaw('ISNULL(`position`), `position` ASC')->select('id', 'ProductName', 'ProductSlug', 'ProductImage', 'ProductHoverImage', 'status', 'position', 'top_rated', 'RelatedProductIds')->inRandomOrder()->take(8)->get();

        $video_galleries = Menu::where('status', 'Active')->get();

        $categoryproducts = Category::where('status', 'Active')->orderBy('position')->get();

        $categoryproducts->each(function ($category) {
            $category->mainproducts = $category->mainproducts()
                ->select('id', 'category_id', 'ProductName', 'ProductSlug', 'ProductImage', 'status', 'position', 'top_rated', 'RelatedProductIds', 'ProductHoverImage')
                ->where('status', 'Active')
                ->orderBy('id', 'desc')
                ->get();
---
select * from `categories` where `status` = 'Active'
select * from `subcategories` where `subcategories`.`category_id` in (1, 3, 5)
select * from `brands` where `status` = 'Active'
select `id`, `slider_btn_link`, `slider_title`, `slider_image` from `sliders` where `status` = 'Active'
select `id`, `add_link`, `add_image`, `status` from `addbanners` where `status` = 'Active' and `id` in ('1', '2')
select `id`, `add_link`, `add_image`, `status` from `addbanners` where `status` = 'Active' and `id` in ('3', '4')
select `id`, `ProductName`, `ProductSlug`, `ProductImage`, `ProductHoverImage`, `status`, `position`, `top_rated`, `RelatedProductIds` from `mainproducts` where `status` = 'Active' and `top_rated` = '1' order by ISNULL(`position`), `position` ASC, `created_at` desc
select `id`, `ProductName`, `ProductSlug`, `ProductImage`, `ProductHoverImage`, `status`, `position`, `top_rated`, `RelatedProductIds` from `mainproducts` where `status` = 'Active' and `bestselling` = '1' order by ISNULL(`position`), `position` ASC, `created_at` desc
select `id`, `ProductName`, `ProductSlug`, `ProductImage`, `ProductHoverImage`, `status`, `position`, `top_rated`, `RelatedProductIds` from `mainproducts` where `status` = 'Active' order by ISNULL(`position`), `position` ASC, `created_at` desc
select `id`, `ProductName`, `ProductSlug`, `ProductImage`, `ProductHoverImage`, `status`, `position`, `top_rated`, `RelatedProductIds` from `mainproducts` where `status` = 'Active' order by ISNULL(`position`), `position` ASC, RAND() limit 8
select * from `menus` where `status` = 'Active'
select * from `categories` where `status` = 'Active' order by `position` asc
select `id`, `category_id`, `ProductName`, `ProductSlug`, `ProductImage`, `status`, `position`, `top_rated`, `RelatedProductIds`, `ProductHoverImage` from `mainproducts` where `mainproducts`.`category_id` = 1 and `mainproducts`.`category_id` is not null and `status` = 'Active' order by `id` desc

        public function campaign($slug)
    {
        $campaign = Campaign::where('slug', $slug)->first();
        $mainproducts = Mainproduct::where('category_id', $campaign->category_id)->select('id', 'category_id', 'ProductName', 'ProductSlug', 'ProductImage', 'RelatedProductIds')->latest()->get();

        $productIds = json_decode($campaign->product_id, true);
        $products = Product::with(['sizes', 'variants'])->whereIn('id', $productIds)->get();
---
select * from `campaigns` where `slug` = 'sei-purono-diner-asl-swad-cena-ghran-uttr-banglar-oitihzbahee-sidl-ekhn-shjei-apnar-ghre' limit 1
select `id`, `category_id`, `ProductName`, `ProductSlug`, `ProductImage`, `RelatedProductIds` from `mainproducts` where `category_id` = '1' order by `created_at` desc
select * from `products` where `id` in ('1', '2', '3', '4')
select * from `sizes` where `sizes`.`product_id` in (1, 2, 3, 4)

    public function campaign_submit(Request $request)
    {
        // return $request;
        $request->validate([
            'name' => 'required',
            'phone' => 'required',
            'address' => 'required'
        ]);

        $block = User::where('ip', \Request::ip())
            ->where('status', 'Block')
            ->first();

        if ($block) {
            return redirect('ip-block');
        }


        if (!$request->product_id || !$request->qty) {
            return redirect('/empty-cart');
        }

        $product = Product::find($request->product_id);

        if (!$product) {
            return redirect('/empty-cart');
        }

        $excutomer = Customer::where('customerPhone', $request->phone)
            ->latest()
            ->first();

        if (isset($excutomer)) {
            $exorder = Order::where('id', $excutomer->order_id)->first();
---
select * from `users` where `ip` = '::1' and `status` = 'Block' limit 1
select * from `products` where `products`.`id` = '1' limit 1
select * from `customers` where `customerPhone` = '01575863073' order by `created_at` desc limit 1
select * from `orders` where `id` = 1 limit 1

            ->first();

        if (!$admin) {
            $admin = Admin::where('status', 'Active')->first();
---
select * from `admins` where `status` = 'Active' limit 1


        $order = new Order();

        $exuser = User::where('email', $request->phone)->first();
---
select * from `users` where `email` = '01575863073' limit 1

            $user->active_status = 0;
            $user->ip = \Request::ip();
            $user->password = Hash::make($request->phone);
            $user->save();
---
insert into `users` (`name`, `email`, `otp`, `active_status`, `ip`, `password`, `updated_at`, `created_at`) values ('Ashikur Rahman', '018436627209', 283442, 0, '::1', '$2y$10$yfvFLONNHELg.o3FXE5XEOX9kp/7rSOzKNiaQVVBlq.cF0Lrjcn1i', '2026-05-02 16:00:49', '2026-05-02 16:00:49')

        $order->zone_id = $request->zone_id ?? null;

        /* VAT */
        $vatInfo = Basicinfo::first();
---
select * from `basicinfos` limit 1

        $order->subTotal = $total + $vat;
        $order->payment_type_id = $request->paymentType ?? 1;
        $order->customerNote = $request->note ?? null;
        $order->save();
---
insert into `orders` (`user_id`, `store_id`, `web_id`, `invoiceID`, `deliveryCharge`, `city_id`, `zone_id`, `vat`, `orderDate`, `subTotal`, `payment_type_id`, `customerNote`, `updated_at`, `created_at`) values (5, 1, 'LandingPage', 'INV0012', '70', '', '', 118.5, '2026-05-02', 2488.5, 1, '', '2026-05-02 16:05:57', '2026-05-02 16:05:57')

        $customer->customerName = $request->name;
        $customer->customerPhone = $request->phone;
        $customer->customerAddress = $request->address;
        $customer->save();

        $product = Product::find($request->product_id);
---
insert into `customers` (`order_id`, `customerName`, `customerPhone`, `customerAddress`, `updated_at`, `created_at`) values (2, 'Ashikur Rahman', '01575863073', 'Mirpur, Dhaka', '2026-05-02 16:05:57', '2026-05-02 16:05:57')
select * from `products` where `products`.`id` = '1' limit 1

        $orderProduct->size = $request->size ?? null;
        $orderProduct->quantity = $request->qty;
        $orderProduct->productPrice = $request->price;
        $orderProduct->save();
---
insert into `orderproducts` (`order_id`, `product_id`, `productCode`, `productName`, `color`, `size`, `quantity`, `productPrice`, `updated_at`, `created_at`) values (2, 1, 'P0001', 'মেডজুল খেজুর | Medjool Dates', 'Red', 'XXL', '1', '2300', '2026-05-02 16:05:57', '2026-05-02 16:05:57')

    public function uniqueID()
    {
        $lastOrder = Order::latest('id')->first();
---
select * from `orders` order by `id` desc limit 1

    public function loadreview(Request $request)
    {
        $reviews = Review::where('status', 'Active')->get()->reverse();
---
select * from `reviews` where `status` = 'Active'

    public function viewproductdetails($slug)
    {
        $singlemain = Mainproduct::where('ProductSlug', $slug)->select('id', 'category_id', 'RelatedProductIds')->first();

        $id = json_decode($singlemain->RelatedProductIds)[0]->productID;
        $productdetails = Product::with([
            'sizes' => function ($query) {
                $query->select('id', 'product_id', 'Discount', 'RegularPrice', 'SalePrice')->where('status', 'Active');
            },
            'weights' => function ($query) {
                $query->select('id', 'product_id', 'Discount', 'RegularPrice', 'SalePrice');
            }
        ])->where('id', $id)->first();
        $varients = Varient::where('product_id', $productdetails->id)->get();

        $relatedproducts = Mainproduct::where('category_id', $singlemain->category_id)->where('status', 'Active')->orderByRaw('ISNULL(`position`), `position` ASC')->select('id', 'ProductName', 'ProductSlug', 'ProductImage', 'status', 'position', 'top_rated', 'RelatedProductIds')->inRandomOrder()->limit(8)->get();
        $sizesolds = Size::where('product_id', $productdetails->id)->where('status', 'Active')->get();
        $weightolds = Weight::where('product_id', $productdetails->id)->get();
---
select `id`, `category_id`, `RelatedProductIds` from `mainproducts` where `ProductSlug` = 'sukkari-mufattal-khejur-sukkari-mufattal-dates' limit 1
select `id`, `product_id`, `Discount`, `RegularPrice`, `SalePrice` from `sizes` where `sizes`.`product_id` in (2) and `status` = 'Active'
select `id`, `product_id`, `Discount`, `RegularPrice`, `SalePrice` from `weights` where `weights`.`product_id` in (2)
select * from `varients` where `product_id` = 2
select `id`, `ProductName`, `ProductSlug`, `ProductImage`, `status`, `position`, `top_rated`, `RelatedProductIds` from `mainproducts` where `category_id` = 1 and `status` = 'Active' order by ISNULL(`position`), `position` ASC, RAND() limit 8
select * from `sizes` where `product_id` = 2 and `status` = 'Active'
select * from `weights` where `product_id` = 2