app/Providers/AppServiceProvider.php

    public function boot()
    {

        view()->composer('*', function ($view) {
            $basicinfo = Basicinfo::first();

            $view->with('basicinfo', $basicinfo);
        });

        View()->composer('webview.partials.header', function ($view) {

            $categories = Category::where('status', 'Active')->select('id', 'category_name', 'slug')->get()->reverse();
            $headcategories = Category::where('status', 'Active')->select('id', 'category_name', 'slug')->latest()->get();
---
select * from `basicinfos` limit 1
select `id`, `category_name`, `slug` from `categories` where `status` = 'Active'
select `id`, `category_name`, `slug` from `categories` where `status` = 'Active' order by `created_at` desc