app/Http/Controllers/Backend/CampaignController.php

select * from `categories` where `status` = 'Active'
---
    public function create()
    {
        $products = Product::where('status', 'Active')->get();
        $categories = Category::where('status', 'Active')->get();

insert into `campaigns` (`name`, `slug`, `title`, `subtitle`, `oldprice_title`, `price_title`, `description`, `why_choose`, `category_id`, `product_id`, `image`, `image2`, `review_images`, `updated_at`, `created_at`) values ('Dorian Joyce', 'dorian-joyce', 'Dolor est amet ut', 'Eaque vel itaque por', '739', '357', '<p>Quifugit, sit, veni.</p>', 'Ea frg&nbsp;', '1', '\"[\\"3\\",\\"4\\",\\"5\\"]\"', 'public/images/campaign/1777799948.9108.webp', 'public/images/campaign/1777799948.9119.webp', '\"[\\"public\\\/images\\\/campaign\\\/reviews\\\/1777799948_69f7130cdee3f.webp\\"]\"', '2026-05-03 15:19:08', '2026-05-03 15:19:08')
---
            $campaign->review_images = json_encode($reviewImagePaths);
        }

        $campaign->save();

select * from `products` where `status` = 'Active'
select * from `categories` where `status` = 'Active'
---
    public function edit($id)
    {
        $campaign = Campaign::findOrFail($id);
        $products = Product::where('status', 'Active')->get();
        $categories = Category::where('status', 'Active')->get();

update `campaigns` set `why_choose` = 'Ea frg ', `category_id` = '', `campaigns`.`updated_at` = '2026-05-03 15:23:10' where `id` = 11
---
            $campaign->review_images = json_encode($reviewImagePaths);
        }

        $campaign->save();

select * from `campaigns` where `campaigns`.`id` = '7' limit 1
delete from `campaigns` where `id` = 7
---
    public function destroy($id)
    {
        $campaign = Campaign::findOrFail($id);
        if ($campaign->image && file_exists(public_path($campaign->image))) {
            unlink(public_path($campaign->image));
        }

        $campaign->delete();