app/Http/Controllers/Backend/CampaignController.php

            $campaign->image2 = $image2Path . $image2Name;
        }

        $campaign->save();
---
update `campaigns` set `image2` = 'public/images/campaign/1777723071.2689.webp', `campaigns`.`updated_at` = '2026-05-02 17:57:51' where `id` = 7