app/Http/Controllers/Backend/CampaignController.php

select * from `campaigns` order by `created_at` desc
---
    public function index()
    {
        $campaigns = Campaign::latest()->get();

select * from `products` where `status` = 'Active'
---
    public function create()
    {
        $products = Product::where('status', 'Active')->get();

insert into `campaigns` (`name`, `slug`, `title`, `subtitle`, `oldprice_title`, `price_title`, `description`, `product_id`, `image`, `updated_at`, `created_at`) values ('Ashikur Rahman', 'ashikur-rahman', 'There are title', 'There are subtitle', '22222', '1111', '<p>Tehj gndf vsdufy sgh sdf sdfhs sdfhs sf sfgs sdfshf s shf s&nbsp;</p>', '[\"1\",\"2\",\"3\"]', 'public/images/campaign/1777710913.5759.webp', '2026-05-02 14:35:13', '2026-05-02 14:35:13')
---
            $campaign->image   = $imagePath . $imageName;
        }

        $campaign->save();

select * from `campaigns` where `campaigns`.`id` = '5' limit 1
select * from `products` where `status` = 'Active'
---
    public function edit($id)
    {
        $campaign = Campaign::findOrFail($id);
        $products = Product::where('status', 'Active')->get();

select * from `campaigns` where `campaigns`.`id` = '5' limit 1
---
    public function update(Request $request, $id)
    {
        $request->validate([
            'name' => 'required|string|max:255',
            'title' => 'required|string|max:255',
            'subtitle' => 'nullable|string|max:255',
            'image' => 'nullable|image|mimes:jpg,jpeg,png,webp|max:2048',
            'oldprice_title' => 'nullable|string|max:255',
            'price_title' => 'nullable|string|max:255',
            'description' => 'nullable|string',
            'product_id' => 'required|array',
        ]);

        $campaign = Campaign::findOrFail($id);

update `campaigns` set `description` = '<p>Tehj gndf vsdufy sgh sdf sdfhs sdfhs sf sfgs sdfshf s shf s </p>', `campaigns`.`updated_at` = '2026-05-02 14:40:30' where `id` = 5
---
            $campaign->image = $imagePath . $imageName;
        }

        $campaign->save();

select * from `campaigns` where `campaigns`.`id` = '10' limit 1
delete from `campaigns` where `id` = 6
---
    public function destroy($id)
    {
        $campaign = Campaign::findOrFail($id);
        if ($campaign->image && file_exists(public_path($campaign->image))) {
            unlink(public_path($campaign->image));
        }

        $campaign->delete();